IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_mem_cfg_regs.xml
	<register id="GSxLOCK" width="32" page="1" offset="0x40" internal="0" description="Global Shared RAM Config Lock Register">
		<bitfield id="LOCK_GS0" description="GS0 RAM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS1" description="GS1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS2" description="GS2 RAM Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS3" description="GS3 RAM Lock bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS4" description="GS4 RAM Lock bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS5" description="GS5 RAM Lock bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS6" description="GS6 RAM Lock bits" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS7" description="GS7 RAM Lock bits" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS8" description="GS8 RAM Lock bits" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS9" description="GS9 RAM Lock bits" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS10" description="GS10 RAM Lock bits" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS11" description="GS11 RAM Lock bits" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS12" description="GS12 RAM Lock bits" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS13" description="GS13 RAM Lock bits" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS14" description="GS14 RAM Lock bits" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS15" description="GS15 RAM Lock bits" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxCOMMIT" width="32" page="1" offset="0x42" internal="0" description="Global Shared RAM Config Lock Commit Register">
		<bitfield id="COMMIT_GS0" description="GS0 RAM Permanent Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS1" description="GS1 RAM Permanent Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS2" description="GS2 RAM Permanent Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS3" description="GS3 RAM Permanent Lock bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS4" description="GS4 RAM Permanent Lock bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS5" description="GS5 RAM Permanent Lock bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS6" description="GS6 RAM Permanent Lock bits" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS7" description="GS7 RAM Permanent Lock bits" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS8" description="GS8 RAM Permanent Lock bits" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS9" description="GS9 RAM Permanent Lock bits" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS10" description="GS10 RAM Permanent Lock bits" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS11" description="GS11 RAM Permanent Lock bits" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS12" description="GS12 RAM Permanent Lock bits" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS13" description="GS13 RAM Permanent Lock bits" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS14" description="GS14 RAM Permanent Lock bits" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS15" description="GS15 RAM Permanent Lock bits" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxMSEL" width="32" page="1" offset="0x44" internal="0" description="Global Shared RAM Master Sel Register">
		<bitfield id="MSEL_GS0" description="Master Select for GS0 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS1" description="Master Select for GS1 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS2" description="Master Select for GS2 RAM" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS3" description="Master Select for GS3 RAM" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS4" description="Master Select for GS4 RAM" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS5" description="Master Select for GS5 RAM" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS6" description="Master Select for GS6 RAM" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS7" description="Master Select for GS7 RAM" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS8" description="Master Select for GS8 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS9" description="Master Select for GS9 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS10" description="Master Select for GS10 RAM" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS11" description="Master Select for GS11 RAM" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS12" description="Master Select for GS12 RAM" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS13" description="Master Select for GS13 RAM" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS14" description="Master Select for GS14 RAM" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_GS15" description="Master Select for GS15 RAM" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxACCPROT0" width="32" page="1" offset="0x48" internal="0" description="Global Shared RAM Access Protection Register 0">
		<bitfield id="FETCHPROT_GS0" description="Fetch Protection For GS0 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS0" description="CPU WR Protection For GS0 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS0" description="DMA WR Protection For GS0 RAM" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS1" description="Fetch Protection For GS1 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS1" description="CPU WR Protection For GS1 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS1" description="DMA WR Protection For GS1 RAM" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS2" description="Fetch Protection For GS2 RAM" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS2" description="CPU WR Protection For GS2 RAM" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS2" description="DMA WR Protection For GS2 RAM" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS3" description="Fetch Protection For GS3 RAM" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS3" description="CPU WR Protection For GS3 RAM" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS3" description="DMA WR Protection For GS3 RAM" begin="26" end="26" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxACCPROT1" width="32" page="1" offset="0x4a" internal="0" description="Global Shared RAM Access Protection Register 1">
		<bitfield id="FETCHPROT_GS4" description="Fetch Protection For GS4 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS4" description="CPU WR Protection For GS4 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS4" description="DMA WR Protection For GS4 RAM" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS5" description="Fetch Protection For GS5 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS5" description="CPU WR Protection For GS5 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS5" description="DMA WR Protection For GS5RAM" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS6" description="Fetch Protection For GS6 RAM" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS6" description="CPU WR Protection For GS6 RAM" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS6" description="DMA WR Protection For GS6RAM" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS7" description="Fetch Protection For GS7 RAM" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS7" description="CPU WR Protection For GS7 RAM" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS7" description="DMA WR Protection For GS7RAM" begin="26" end="26" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxACCPROT2" width="32" page="1" offset="0x4c" internal="0" description="Global Shared RAM Access Protection Register 2">
		<bitfield id="FETCHPROT_GS8" description="Fetch Protection For GS8 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS8" description="CPU WR Protection For GS8 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS8" description="DMA WR Protection For GS8 RAM" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS9" description="Fetch Protection For GS9 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS9" description="CPU WR Protection For GS9 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS9" description="DMA WR Protection For GS9RAM" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS10" description="Fetch Protection For GS10 RAM" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS10" description="CPU WR Protection For GS10 RAM" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS10" description="DMA WR Protection For GS10RAM" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS11" description="Fetch Protection For GS11 RAM" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS11" description="CPU WR Protection For GS11 RAM" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS11" description="DMA WR Protection For GS11RAM" begin="26" end="26" width="1" rwaccess="RW"/>
	</register>
