IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_mem_cfg_regs.xml
	<register id="GSxACCPROT3" width="32" page="1" offset="0x4e" internal="0" description="Global Shared RAM Access Protection Register 3">
		<bitfield id="FETCHPROT_GS12" description="Fetch Protection For GS12 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS12" description="CPU WR Protection For GS12 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS12" description="DMA WR Protection For GS12 RAM" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS13" description="Fetch Protection For GS13 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS13" description="CPU WR Protection For GS13 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS13" description="DMA WR Protection For GS13RAM" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS14" description="Fetch Protection For GS14 RAM" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS14" description="CPU WR Protection For GS14 RAM" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS14" description="DMA WR Protection For GS14RAM" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS15" description="Fetch Protection For GS15 RAM" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS15" description="CPU WR Protection For GS15 RAM" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS15" description="DMA WR Protection For GS15RAM" begin="26" end="26" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxTEST" width="32" page="1" offset="0x50" internal="0" description="Global Shared RAM TEST Register">
		<bitfield id="TEST_GS0" description="Selects the different modes for GS0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS1" description="Selects the different modes for GS1 RAM" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS2" description="Selects the different modes for GS2 RAM" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS3" description="Selects the different modes for GS3 RAM" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS4" description="Selects the different modes for GS4 RAM" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS5" description="Selects the different modes for GS5 RAM" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS6" description="Selects the different modes for GS6 RAM" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS7" description="Selects the different modes for GS7 RAM" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS8" description="Selects the different modes for GS8 RAM" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS9" description="Selects the different modes for GS9 RAM" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS10" description="Selects the different modes for GS10 RAM" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS11" description="Selects the different modes for GS11 RAM" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS12" description="Selects the different modes for GS12 RAM" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS13" description="Selects the different modes for GS13 RAM" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS14" description="Selects the different modes for GS14 RAM" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS15" description="Selects the different modes for GS15 RAM" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GSxINIT" width="32" page="1" offset="0x52" internal="0" description="Global Shared RAM Init Register">
		<bitfield id="INIT_GS0" description="RAM Initialization control for GS0 RAM." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS1" description="RAM Initialization control for GS1 RAM." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS2" description="RAM Initialization control for GS2 RAM." begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS3" description="RAM Initialization control for GS3 RAM." begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS4" description="RAM Initialization control for GS4 RAM." begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS5" description="RAM Initialization control for GS5 RAM." begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS6" description="RAM Initialization control for GS6 RAM." begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS7" description="RAM Initialization control for GS7 RAM." begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS8" description="RAM Initialization control for GS8 RAM." begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS9" description="RAM Initialization control for GS9 RAM." begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS10" description="RAM Initialization control for GS10 RAM." begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS11" description="RAM Initialization control for GS11 RAM." begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS12" description="RAM Initialization control for GS12 RAM." begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS13" description="RAM Initialization control for GS13 RAM." begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS14" description="RAM Initialization control for GS14 RAM." begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS15" description="RAM Initialization control for GS15 RAM." begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxINITDONE" width="32" page="1" offset="0x54" internal="0" description="Global Shared RAM InitDone Status Register">
		<bitfield id="INITDONE_GS0" description="RAM Initialization status for GS0 RAM." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS1" description="RAM Initialization status for GS1 RAM." begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS2" description="RAM Initialization status for GS2 RAM." begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS3" description="RAM Initialization status for GS3 RAM." begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS4" description="RAM Initialization status for GS4 RAM." begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS5" description="RAM Initialization status for GS5 RAM." begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS6" description="RAM Initialization status for GS6 RAM." begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS7" description="RAM Initialization status for GS7 RAM." begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS8" description="RAM Initialization status for GS8 RAM." begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS9" description="RAM Initialization status for GS9 RAM." begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS10" description="RAM Initialization status for GS10 RAM." begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS11" description="RAM Initialization status for GS11 RAM." begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS12" description="RAM Initialization status for GS12 RAM." begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS13" description="RAM Initialization status for GS13 RAM." begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS14" description="RAM Initialization status for GS14 RAM." begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS15" description="RAM Initialization status for GS15 RAM." begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="GSxRAMTEST_LOCK" width="32" page="1" offset="0x56" internal="0" description="Lock register to GSx RAM TEST registers">
		<bitfield id="GS0" description="GSxTEST.TEST_GS0 LOCK" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GS1" description="GSxTEST.TEST_GS1 LOCK" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GS2" description="GSxTEST.TEST_GS2 LOCK" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GS3" description="GSxTEST.TEST_GS3 LOCK" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GS4" description="GSxTEST.TEST_GS4 LOCK" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GS5" description="GSxTEST.TEST_GS5 LOCK" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GS6" description="GSxTEST.TEST_GS6 LOCK" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GS7" description="GSxTEST.TEST_GS7 LOCK" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GS8" description="GSxTEST.TEST_GS8 LOCK" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GS9" description="GSxTEST.TEST_GS9 LOCK" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GS10" description="GSxTEST.TEST_GS10 LOCK" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GS11" description="GSxTEST.TEST_GS11 LOCK" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GS12" description="GSxTEST.TEST_GS12 LOCK" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GS13" description="GSxTEST.TEST_GS13 LOCK" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GS14" description="GSxTEST.TEST_GS14 LOCK" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GS15" description="GSxTEST.TEST_GS15 LOCK" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MSGxLOCK" width="32" page="1" offset="0x60" internal="0" description="Message RAM Config Lock Register">
		<bitfield id="LOCK_CPUTOCPU_MSGRAM0" description="CPUTOCPU RAM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CPUTOCLA1" description="CPUTOCLA1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CLA1TOCPU" description="CLA1TOCPU RAM Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CLA1TODMA" description="CLA1TODMA RAM control fields lock bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_DMATOCLA1" description="DMATOCLA1 RAM control fields lock bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CPUTOCPU_MSGRAM1" description="Lock bit of CPU to CPU MSG RAM1 control fields" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CPUTOCM_MSGRAM0" description="Lock bit of CPU to CM MSG RAM0 control fields" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CPUTOCM_MSGRAM1" description="Lock bit of CPU to CM MSG RAM1 control fields" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CLA2TODMA" description="Lock bit of CLA to DMA MSG RAM control fields" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_DMATOCLA2" description="Lock bit of DMA to CLA MSG RAM control fields" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="MSGxCOMMIT" width="32" page="1" offset="0x62" internal="0" description="Message RAM Config Lock Commit Register">
		<bitfield id="COMMIT_CPUTOCPU_MSGRAM0" description="CPUTOCPU RAM control fields COMMIT bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_CPUTOCLA1" description="CPUTOCLA1 RAM control fields COMMIT bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_CLA1TOCPU" description="CLA1TOCPU RAM control fields COMMIT bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_CLA1TODMA" description="CLA1TODMA RAM control fields COMMIT bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_DMATOCLA1" description="DMATOCLA1 RAM control fields COMMIT bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_CPUTOCPU_MSGRAM1" description="Commint bit of CPU to CPU MSG RAM1 control fields" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_CPUTOCM_MSGRAM0" description="Commint bit of CPU to CM MSG RAM0 control fields" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_CPUTOCM_MSGRAM1" description="Commint bit of CPU to CM MSG RAM1 control fields" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_CLATODMA_MSGRAM0" description="Commint bit of CLA to DMA MSG RAM control fields" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_DMATOCLA_MSGRAM1" description="Commint bit of DMA to CLA MSG RAM control fields" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="MSGxACCPROT0" width="32" page="1" offset="0x68" internal="0" description="Message RAM Access Protection Register 0">
		<bitfield id="CPUWRPROT_CPUTOCPU_MSGRAM0" description="CPU WR Protection For CPUTOCPU_MSGRAM0 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_CPUTOCPU_MSGRAM0" description="DMA WR Protection For CPUTOCPU_MSGRAM0 RAM" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="MSGxACCPROT1" width="32" page="1" offset="0x6a" internal="0" description="Message RAM Access Protection Register 1">
		<bitfield id="CPUWRPROT_CPUTOCPU_MSGRAM1" description="CPU WR Protection For CPUTOCPU_MSGRAM1 RAM" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_CPUTOCPU_MSGRAM1" description="DMA WR Protection For CPUTOCPU_MSGRAM1RAM" begin="26" end="26" width="1" rwaccess="RW"/>
	</register>
