IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_mem_cfg_regs.xml
	<register id="MSGxACCPROT2" width="32" page="1" offset="0x6c" internal="0" description="Message RAM Access Protection Register 2">
		<bitfield id="CPUWRPROT_CPUTOCM_MSGRAM0" description="CPU WR Protection For CPUTOCM_MSGRAM0 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_CPUTOCM_MSGRAM0" description="DMA WR Protection For CPUTOCM_MSGRAM0 RAM" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_CPUTOCM_MSGRAM1" description="CPU WR Protection For CPUTOCM_MSGRAM1 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_CPUTOCM_MSGRAM1" description="DMA WR Protection For CPUTOCM_MSGRAM1RAM" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="MSGxTEST" width="32" page="1" offset="0x70" internal="0" description="Message RAM TEST Register">
		<bitfield id="TEST_CPUTOCPU_MSGRAM0" description="CPU to CPU Mode Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_CPUTOCLA1" description="CPU to CLA1 MSG RAM Mode Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TEST_CLA1TOCPU" description="CLA1 to CPU MSG RAM Mode Select" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="TEST_CLA1TODMA" description="CLA1 to DMA MSG RAM Mode Select" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="TEST_DMATOCLA1" description="DMA to CLA1 MSG RAM Mode Select" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="TEST_CPUTOCPU_MSGRAM1" description="CPU to CPU Mode Select" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="TEST_CPUTOCM_MSGRAM0" description="CPU to CM Mode Select" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="TEST_CPUTOCM_MSGRAM1" description="CPU to CM Mode Select" begin="19" end="18" width="2" rwaccess="RW"/>
	</register>
	<register id="MSGxINIT" width="32" page="1" offset="0x72" internal="0" description="Message RAM Init Register">
		<bitfield id="INIT_CPUTOCPU_MSGRAM0" description="Initialization control for CPU to CPU MSG RAM0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT_CPUTOCLA1" description="Initialization control for CPUTOCLA1 MSG RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INIT_CLA1TOCPU" description="Initialization control for CLA1TOCPU MSG RAM" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INIT_CLA1TODMA" description="Initialization control for CLA1 to DMA MSG RAM" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INIT_DMATOCLA1" description="Initialization control for DMA to CLA1 MSG RAM" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INIT_CPUTOCPU_MSGRAM1" description="Initialization control for CPU to CPU MSG RAM1" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INIT_CPUTOCM_MSGRAM0" description="Initialization control for CPU to CM MSG RAM0" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INIT_CPUTOCM_MSGRAM1" description="Initialization control for CPU to CM MSG RAM1" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="MSGxINITDONE" width="32" page="1" offset="0x74" internal="0" description="Message RAM InitDone Status Register">
		<bitfield id="INITDONE_CPUTOCPU_MSGRAM0" description="Initialization status for CPU to CPU MSG RAM" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_CPUTOCLA1" description="Initialization status for CPU to CLA1 MSG RAM" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_CLA1TOCPU" description="Initialization status for CLA1 to CPU MSG RAM" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_CLA1TODMA" description="Initialization status for CLA1 to DMA MSG RAM" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_DMATOCLA1" description="Initialization status for DMA to CLA1 MSG RAM" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_CPUTOCPU_MSGRAM1" description="Initialization status for CPU to CPU MSG RAM1" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_CPUTOCM_MSGRAM0" description="Initialization status for CPU to CM MSG RAM0" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_CPUTOCM_MSGRAM1" description="Initialization status for CPU to CM MSG RAM1" begin="9" end="9" width="1" rwaccess="R"/>
	</register>
	<register id="MSGxRAMTEST_LOCK" width="32" page="1" offset="0x76" internal="0" description="Lock register to MSGx RAM TEST registers">
		<bitfield id="CPUTOCPU_MSGRAM0" description="MSGxTEST.TEST_CPUTOCPU_MSGRAM0 LOCK" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUTOCLA1" description="MSGxTEST.TEST_CPUTOCLA1 LOCK" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLA1TOCPU" description="MSGxTEST.TEST_CLA1TOCPU LOCK" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CPUTOCLA2" description="MSGxTEST.TEST_CPUTOCLA2 LOCK" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLA2TOCPU" description="MSGxTEST.TEST_CLA2TOCPU LOCK" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLA1TODMA" description="MSGxTEST.TEST_CLA1TODMA LOCK" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DMATOCLA1" description="MSGxTEST.TEST_DMATOCLA1 LOCK" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CPUTOCPU_MSGRAM1" description="MSGxTEST.TEST_CPUTOCPU_MSGRAM1 LOCK" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CPUTOCM_MSGRAM0" description="MSGxTEST.TEST_CPUTOCM_MSGRAM0 LOCK" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUTOCM_MSGRAM1" description="MSGxTEST.TEST_CPUTOCM_MSGRAM1 LOCK" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CLA2TODMA" description="MSGxTEST.TEST_CLA2TODMA LOCK" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="DMATOCLA2" description="MSGxTEST.TEST_DMATOCLA2 LOCK" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="ROM_LOCK" width="32" page="1" offset="0xa0" internal="0" description="ROM Config Lock Register">
		<bitfield id="LOCK_BOOTROM" description="BOOTROM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_SECUREROM" description="SECUREROM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CLADATAROM" description="CLADATAROM Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
