IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_mem_cfg_regs.xml
	<register id="ROM_TEST" width="32" page="1" offset="0xa2" internal="0" description="ROM  TEST Register">
		<bitfield id="TEST_BOOTROM" description="Selects the different modes for BOOTROM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_SECUREROM" description="Selects the different modes for SECUREROM" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TEST_CLADATAROM" description="Selects the different modes for CLADATAROM" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="ROM_FORCE_ERROR" width="32" page="1" offset="0xa4" internal="0" description="ROM Force Error register">
		<bitfield id="FORCE_BOOTROM_ERROR" description="Force Bootrom Parity Error" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FORCE_SECUREROM_ERROR" description="Force SECUREROM Parity Error" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FORCE_CLADATAROM_ERROR" description="Force CLADATAROM Parity Error" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="PERI_MEM_TEST_LOCK" width="32" page="1" offset="0xaa" internal="0" description="Peripheral Memory Test Lock Register">
		<bitfield id="LOCK_PERI_MEM_TEST_CONTROL" description="PERI_MEM_TEST_CONTROL Lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="PERI_MEM_TEST_CONTROL" width="32" page="1" offset="0xac" internal="0" description="Peripheral Memory Test control Register">
		<bitfield id="EtherCAT_TEST_ENABLE" description="EtherCAT Test mode enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EtherCAT_MEM_FORCE_ERROR" description="Force Parity Error on EtherCAT RAM" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
</module>
